tutorials/blastFoam/aerofoilNACA0012/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme HLLC;

ddtSchemes
{
    default         Euler;
    timeIntegrator  Euler;
}

gradSchemes
{
    default         cellMDLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    turbulence      Gauss linearUpwind limited;

    div(rhoPhi,k)      $turbulence;
    div(rhoPhi,omega)  $turbulence;

    div(tauMC)    Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    reconstruct(rho) linearUpwind limited;
    reconstruct(e)   linearUpwind limited;
    reconstruct(U)   linearUpwindV limited;
    reconstruct(c) linearUpwind limited;
    reconstruct(p) linearUpwind limited;

}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
